# Список формується з додатних та від’ємних цілих чисел загальною кількістю не менше 5.
# Обчислити суму кубів 5 його найбільших елементів.

str = input("Введіть список чисел: ")
try:
    numbers = [int(x) for x in str.split()]
except ValueError:
    print("Некоректний ввід. Будь ласка, введіть лише цілі числа")
    exit(1)
if len(numbers) < 5:
    print("Список повинен містити не менше 5 чисел.")
else:
    sum = sorted(numbers)[-5:]
    sum = sum[0]**3 + sum[1]**3 + sum[2]**3 + sum[3]**3 + sum[4]**3
    print("Сума кубів 5 найбільших елементів:", sum)
