# Петро та Олена грають у гру.
# Петро загадує натуральне число від 1 до 100.
# Олена намагається вгадати це число, називаючи деяку множину натуральних чисел через кому з пропуском.
# Якщо число присутнє у цій множині, то Петро каже «Yes», якщо його не має – «No».
# Після декількох запитань Олена заплуталася і не пам’ятає,
# які питання задавала та просить у Петра допомоги «HELP»,
# у відповідь Петро називає ті числа, які казала Олена і серед яких є правильна відповідь.
# Кількість спроб Олени обмежена (задається з консолі).
import random

number = random.randint(1, 100)
print(f"Петро: Я загадав число від 1 до 100, скільки хочеш спроб? ({number})")
s = int(input("Олена: "))
print(f"Петро: гаразд, {s} спроб, почнімо...")
numbersOlena = []
while s > 0:
    str = input("Олена: ")
    if str == "HELP":
        print(numbersOlena)
    else:
        numbers = [int(x) for x in str.split(", ")]
        if numbers[0] == number and len(numbers) == 1:
            print("Петро: Перемога!")
            break
        if number in numbers: 
            print("Петро: Yes")
            numbersOlena.append(numbers)
        else:
            s -= 1
            print("Петро: No, спроб залишилось:", s)
if s == 0:
    print("Петро: Я загадав число", number)